[EclecticIQ alert]
search = `eiq_sightings_search` (last_ip=* OR dest=* OR dst=* OR query=* OR url=* OR file_hash=* OR md5=* OR sha1=* OR sha256=* OR sha512=* OR sender=* OR src_user=* OR src_ip=* OR src=* OR hostname=* OR recipient=* OR receiver=* OR dest_user=* OR domain=*) \
| rex field=url "(http(?s)\:\/\/)(?<eiq_domain>[\w\-\.]+)(\:|\/|$)" \
| eval eiq_dest=coalesce(last_ip, dest, dst) \
| eval eiq_src=coalesce(src_ip, src) \
| eval eiq_domain=coalesce(domain, query, eiq_domain, hostname) \
| eval eiq_url=coalesce(uri, query) \
| eval eiq_file_hash=coalesce(file_hash,hash-md5, md5, sha1, sha256, sha512) \
| eval eiq_sender=coalesce(sender, src_user) \
| eval eiq_receiver=coalesce(recipient, receiver, dest_user) \
| lookup eiq_ioc_list value_eiq as eiq_src OUTPUTNEW value_eiq AS value_eiq_src confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| lookup eiq_ioc_list value_eiq as eiq_dest OUTPUTNEW value_eiq AS value_eiq_dest confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| lookup eiq_ioc_list value_eiq as eiq_file_hash OUTPUTNEW value_eiq AS value_eiq_file_hash confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key \
| lookup eiq_ioc_list value_eiq as eiq_domain OUTPUTNEW value_eiq AS value_eiq_domain confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| lookup eiq_ioc_list value_eiq as eiq_url OUTPUTNEW value_eiq AS value_eiq_url confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| lookup eiq_ioc_list value_eiq as eiq_sender OUTPUTNEW value_eiq AS value_eiq_sender confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key \
| lookup eiq_ioc_list value_eiq as eiq_receiver OUTPUTNEW value_eiq AS value_eiq_receiver confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| search (value_eiq_src= OR value_eiq_dest= OR value_eiq_file_hash= OR value_eiq_domain= OR value_eiq_url= OR value_eiq_sender= OR value_eiq_receiver=) value_eiq=\
| eval alert_field=case(isnotnull(value_eiq_src), "src", isnotnull(value_eiq_dest), "dest", isnotnull(value_eiq_file_hash), "file_hash", isnotnull(value_eiq_domain), "domain", isnotnull(value_eiq_url), "url", isnotnull(value_eiq_sender), "sender", isnotnull(value_eiq_receiver), "receiver") \
| eval event_hash=sha512(_raw) \
| eval alert_source="splunk_search" \
| eval entity_id=trim(split(entity_id,",")) \
| eval observable_id = _key\
| mvexpand entity_id \
| join entity_id type=inner max=0 \
    [| inputlookup eiq_entities_list \
    | eval observable_ids=trim(split(observable_ids,",")) \
    | mvexpand observable_ids \
    | eval entity_id = _key ] \
| eval key=_time."-".'event_hash'\
| dedup key \
| eval event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,dest=eiq_dest ,entity_title_eiq=entity_data_title, feed_id_eiq = feed_id , sighting ="0", src=eiq_src, source_name_eiq= entity_sources\
| table key, observable_id,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Domain]
search = `eiq_dm_alert_domain` \
| lookup eiq_ioc_list value_eiq as domain OUTPUTNEW value_eiq AS value_eiq_domain confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| search value_eiq_domain=* \
| eval alert_field=case(isnotnull(value_eiq_domain), "domain") \
| eval event_hash=sha512(sourcetype.index._time.host.value_eiq)\
| eval alert_source="splunk_dm_search"\
| eval entity_id=trim(split(entity_id,",")) \
|eval observable_id = _key\
| mvexpand entity_id \
| join entity_id type=inner max=0 \
    [| inputlookup eiq_entities_list \
    | eval observable_ids=trim(split(observable_ids,",")) \
    | mvexpand observable_ids \
    | eval entity_id = _key ] \
| eval event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,dest=value_eiq_dest ,entity_title_eiq=entity_data_title, feed_id_eiq = feed_id , sighting ="0", src=value_eiq_src, source_name_eiq= entity_sources\
| stats values(entity_id) as entity_id,values(observable_id) as observable_id,values( alert_field) as alert_field,values( alert_source) as alert_source,values(confidence_eiq) as confidence_eiq,values( src) as src,values( dest) as dest,values(entity_title_eiq) as entity_title_eiq,values( event_time) as event_time,values( event_hash) as event_hash,values( event_index) as event_index,values( event_host) as event_host,values( event_sourcetype) as event_sourcetype,values(feed_id_eiq) as feed_id_eiq,values( value_url_eiq) as value_url_eiq,values( type_eiq) as type_eiq,values( timestamp_eiq) as timestamp_eiq,values( source_name_eiq) as source_name_eiq,values( meta_entity_url_eiq) as meta_entity_url_eiq,values( value_eiq) as value_eiq,values( last_updated_at) as last_updated_at,values( entity_type) as entity_type,values( sighting) as sighting by id_eiq\
|eval key=_time."-".'event_hash'\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting observable_id\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Email]
search = `eiq_dm_alert_email` \
| lookup eiq_ioc_list value_eiq as src OUTPUTNEW value_eiq AS value_eiq_src confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| lookup eiq_ioc_list value_eiq as dest OUTPUTNEW value_eiq AS value_eiq_dest confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| search value_eiq_src=* OR value_eiq_dest=*\
| eval event_hash=sha512(sourcetype.index._time.host.value_eiq)\
| eval alert_source="splunk_dm_search"\
| eval entity_id=trim(split(entity_id,",")) \
|eval observable_id = _key\
| mvexpand entity_id \
| join entity_id type=inner max=0 \
    [| inputlookup eiq_entities_list \
    | eval observable_ids=trim(split(observable_ids,",")) \
    | mvexpand observable_ids \
    | eval entity_id = _key ] \
| eval event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,dest=value_eiq_dest ,entity_title_eiq=entity_data_title, feed_id_eiq = feed_id , sighting ="0", src=value_eiq_src, source_name_eiq= entity_sources\
| stats values(entity_id) as entity_id,values(observable_id) as observable_id,values( alert_field) as alert_field,values( alert_source) as alert_source,values(confidence_eiq) as confidence_eiq,values( src) as src,values( dest) as dest,values(entity_title_eiq) as entity_title_eiq,values( event_time) as event_time,values( event_hash) as event_hash,values( event_index) as event_index,values( event_host) as event_host,values( event_sourcetype) as event_sourcetype,values(feed_id_eiq) as feed_id_eiq,values( value_url_eiq) as value_url_eiq,values( type_eiq) as type_eiq,values( timestamp_eiq) as timestamp_eiq,values( source_name_eiq) as source_name_eiq,values( meta_entity_url_eiq) as meta_entity_url_eiq,values( value_eiq) as value_eiq,values( last_updated_at) as last_updated_at,values( entity_type) as entity_type,values( sighting) as sighting by id_eiq\
| eval key=_time."-".'event_hash'\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting observable_id\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Hash]
search = `eiq_dm_alert_hash`  \
| lookup eiq_ioc_list value_eiq as file_hash OUTPUTNEW value_eiq AS value_eiq_file_hash confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| search value_eiq_file_hash=* \
| eval event_hash=sha512(sourcetype.index._time.host.value_eiq) \
| eval alert_source="splunk_dm_search" \
| eval entity_id=trim(split(entity_id,",")) \
| eval observable_id =_key\
| mvexpand entity_id \
| join entity_id type=inner max=0 \
    [| inputlookup eiq_entities_list \
    | eval observable_ids=trim(split(observable_ids,",")) \
    | mvexpand observable_ids \
    | eval entity_id = _key ] \
| eval event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,dest=value_eiq_dest ,entity_title_eiq=entity_data_title, feed_id_eiq = feed_id , sighting ="0", src=value_eiq_src, source_name_eiq= entity_sources \
| stats values(entity_id) as entity_id,values(observable_id) as observable_id,values( alert_field) as alert_field,values( alert_source) as alert_source,values(confidence_eiq) as confidence_eiq,values( src) as src,values( dest) as dest,values(entity_title_eiq) as entity_title_eiq,values( event_time) as event_time,values( event_hash) as event_hash,values( event_index) as event_index,values( event_host) as event_host,values( event_sourcetype) as event_sourcetype,values(feed_id_eiq) as feed_id_eiq,values( value_url_eiq) as value_url_eiq,values( type_eiq) as type_eiq,values( timestamp_eiq) as timestamp_eiq,values( source_name_eiq) as source_name_eiq,values( meta_entity_url_eiq) as meta_entity_url_eiq,values( value_eiq) as value_eiq,values( last_updated_at) as last_updated_at,values( entity_type) as entity_type,values( sighting) as sighting by id_eiq \
| table entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting observable_id

[EclecticIQ tstats Threat Intelligence alert - Source/Destination]
search = `eiq_dm_alert_src_dst` \
| lookup eiq_ioc_list value_eiq as src OUTPUTNEW value_eiq AS value_eiq_src confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key \
| lookup eiq_ioc_list value_eiq as dest OUTPUTNEW value_eiq AS value_eiq_dest confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key \
| search value_eiq_src=* OR value_eiq_dest=* \
| eval alert_field=case(isnotnull(value_eiq_src), "src", isnotnull(value_eiq_dest), "dest") \
| eval event_hash=sha512(sourcetype.index._time.host.value_eiq) \
| eval alert_source="splunk_dm_search" \
| eval entity_id=trim(split(entity_id,",")) \
| eval observable_id = _key\
| mvexpand entity_id \
| join entity_id type=inner max=0 \
    [| inputlookup eiq_entities_list \
    | eval observable_ids=trim(split(observable_ids,",")) \
    | mvexpand observable_ids \
    | eval entity_id = _key ] \
| eval event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,dest=value_eiq_dest ,entity_title_eiq=entity_data_title, feed_id_eiq = feed_id , sighting ="0", src=value_eiq_src, source_name_eiq= entity_sources \
| stats values(entity_id) as entity_id,values(observable_id) as observable_id,values( alert_field) as alert_field,values( alert_source) as alert_source,values(confidence_eiq) as confidence_eiq,values( src) as src,values( dest) as dest,values(entity_title_eiq) as entity_title_eiq,values( event_time) as event_time,values( event_hash) as event_hash,values( event_index) as event_index,values( event_host) as event_host,values( event_sourcetype) as event_sourcetype,values(feed_id_eiq) as feed_id_eiq,values( value_url_eiq) as value_url_eiq,values( type_eiq) as type_eiq,values( timestamp_eiq) as timestamp_eiq,values( source_name_eiq) as source_name_eiq,values( meta_entity_url_eiq) as meta_entity_url_eiq,values( value_eiq) as value_eiq,values( last_updated_at) as last_updated_at,values( entity_type) as entity_type,values( sighting) as sighting by id_eiq \
| table entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting observable_id

[EclecticIQ tstats Threat Intelligence alert - URL]
search = `eiq_dm_alert_url` \
| lookup eiq_ioc_list value_eiq as url OUTPUTNEW value_eiq AS value_eiq_url confidence_eiq created_at_eiq entity_id id_eiq last_updated_at_eiq type_eiq value_eiq _key\
| search value_eiq_url=* \
| eval event_hash=sha512(sourcetype.index._time.host.value_eiq) \
| eval alert_source="splunk_dm_search" \
| eval entity_id=trim(split(entity_id,",")) \
| eval observable_id = _key\
| mvexpand entity_id \
| join entity_id type=inner max=0 \
    [| inputlookup eiq_entities_list \
    | eval observable_ids=trim(split(observable_ids,",")) \
    | mvexpand observable_ids \
    | eval entity_id = _key ] \
| eval event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,dest=value_eiq_dest ,entity_title_eiq=entity_data_title, feed_id_eiq = feed_id , sighting ="0", src=value_eiq_src, source_name_eiq= entity_sources \
| stats values(entity_id) as entity_id,values(observable_id) as observable_id,values( alert_field) as alert_field,values( alert_source) as alert_source,values(confidence_eiq) as confidence_eiq,values( src) as src,values( dest) as dest,values(entity_title_eiq) as entity_title_eiq,values( event_time) as event_time,values( event_hash) as event_hash,values( event_index) as event_index,values( event_host) as event_host,values( event_sourcetype) as event_sourcetype,values(feed_id_eiq) as feed_id_eiq,values( value_url_eiq) as value_url_eiq,values( type_eiq) as type_eiq,values( timestamp_eiq) as timestamp_eiq,values( source_name_eiq) as source_name_eiq,values( meta_entity_url_eiq) as meta_entity_url_eiq,values( value_eiq) as value_eiq,values( last_updated_at) as last_updated_at,values( entity_type) as entity_type,values( sighting) as sighting by id_eiq \
| table entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting observable_id
